lectures/week6/week6.org
#+TITLE: Monte Carlo methods
#+AUTHOR: WISM454 Laboratory Class Scientific Computing, Jan-Willem Buurlage
#+EMAIL: j.buurlage@cwi.nl

# Beamer specific:
#+startup: beamer
#+LaTeX_CLASS: beamer
#+LaTeX_CLASS_OPTIONS: [10pt]
#+BEAMER_FRAME_LEVEL: 2
#+BEAMER_THEME: metropolis [progressbar=head]
#+OPTIONS: H:2
#+OPTIONS: toc:nil

# CI CWI theme specific:
#+LATEX_HEADER: \usepackage{tikz}
#+LATEX_HEADER: \definecolor{cwiRed}{HTML}{BF1238}
#+LATEX_HEADER: \definecolor{cwiBlue}{HTML}{0B5D7D}
#+LATEX_HEADER: \setbeamertemplate{footline}[text line]{%
#+LATEX_HEADER:   \parbox{\linewidth}{\noindent\vspace*{2pt}\noindent\rule{\linewidth}{0.4pt}\\{\scriptsize\noindent\vspace*{7pt}\insertshortauthor\hfill\insertshorttitle\hfill\insertdate}}
#+LATEX_HEADER: }
#+LATEX_HEADER: \renewcommand*\footnoterule{}
#+LATEX_HEADER: \renewcommand{\vec}[1]{\mathbf{#1}}
#+LATEX_HEADER: \usepackage{lmodern}

* Organization
** Today
- If you wish, you can e-mail me a zip file with your source files (do not
  include anything other than *.hpp, *.cpp, CMakeLists.txt files).
- I can give you initial feedback on your code and library design (not for a
  grade). You can use this to improve your code before the report.
- Only today!
** Report I
- /Deadline:/ April 17th
- Content of report
  1. *Theory*.
     - A description of LCRNGs and the influence of parameters.
     - Distributions, inversion and rejection.
     - A discussion on statistical properties and tests.
     - Numerical integration, Monte Carlo.
  2. *Software library*. Describe your software library, with discussions on usage
   and design choices. After reading this section, the reader should be able to
   understand how to use every aspect of your library.
  3. *Numerical results*.
** How it is graded
- You will receive an independent grade for the following:
  - Writing
  - Presentation
  - Experiments
  - Features
  - Code
- They all count for 20%.
- Scientific writing skills are important for any researcher. I expect the
  reports to be written with care. Try to avoid spending 99% of your time on
  your code and rushing the report.
** Remarks on report
- Do not include your source code in the report, but instead *e-mail* me a zip
  file with your source files (do not include anything other than *.hpp, *.cpp,
  CMakeLists.txt files).
- Describe the overall structure of your code on a *high-level*. For example,
  discuss the different classes (such as =lcrng=) you have and how they relate
  to each other.
- All *exercises* listed in the schedule, except those marked hand-in or optional,
  are expected to be treated in your reports. Do not refer to them (or the
  lecture notes in general) explicitly, but rather make them part of the story.
- Provide *benchmark results*, and the results of *statistical tests* when run on
  the RNG engines you provide. Be economical with your plots and tables. Make
  sure that every result you include is indispensable for the story that you
  want to tell about the RNGs and your library. After reading this, the reader
  should be able to make an informed decision on which parts of your library they
  want to use for his application.
* Monte Carlo Methods (I)
** Numerical computation of integrals
- *Input*: integration domain $\Omega\subseteq \mathbb{R}^d$ and *black box access* to $$f:\mathbb{R}^d\to\mathbb{R}$$
- *Output*: approximation of $$\int_\Omega f(\vec{x}) d\vec{x}$$
** Three strategies

Main idea:
$$\int_\Omega f(\vec{x}) d\vec{x} \approx \sum_{i \in I} w_i f(\vec{x}_i)$$

How to find *weights* $w_i\in\mathbb{R}$ and *integration points* $\vec{x}_i \in \mathbb{R}^d$?

- Quadrature formulas $\hfill$ ([LN] 3.1)
- Monte Carlo $\hfill$ ([LN] 3.2)
- Low-discrepancy sampling $\hfill$ ([LN] 3.3)

** Quadrature formulas
- Assume for now:
  - 1-dimensional $\quad f : \mathbb{R} \to \mathbb{R}$
  - twice continuously differentiable
- The *trapezoidal rule* is
  $$\int_{a}^{b} f(x) dx \approx \frac{b-a}{2}\left( f(a) + f(b) \right)$$
- With *remainder* (i.e. error)
  $$R = - \frac{(b-a)^3}{12} f''(\eta)\qquad \text{for a }\eta\in[a,b]$$

** Quadrature formulas

- Divide $[a,b]$ into $k$ intervals of size $h = \frac{b-a}{k}$. 

- The $k+1$ integration points are now $\{a, a + h, a+2h, ..., b\}$
  $$\int_{a}^{b} f(x) dx \approx h \left( \frac{1}{2}f(a) + \left( \sum_{j=1}^{k-1} f(a+j\cdot h) \right) + \frac{1}{2}f(b) \right)$$
- Remainder satisfies
  $$R = \frac{b-a}{12} h^2 \left[ f'(b) - f'(a) \right] + \mathcal{O}(h^3) \quad \text{for } h\to 0$$
  and is bounded by
  $$|R| \leq \frac{b-a}{12} h^2 \; \max_{x\in[a,b]} | f''(x) |$$
** Accuracy
- For $k$ intervals of size $h$
  $$|R| \leq \frac{b-a}{12} h^2 \; \max_{x\in[a,b]} | f''(x) |$$
- For a fixed function $f$ and fixed integration domain $[a,b]$ we have
  $$|R| = \mathcal{O}(h^2) = \mathcal{O} \left( \frac{1}{k^2} \right)$$
- To get accuracy $|R| \leq \epsilon$, we require $k \propto
  \frac{1}{\sqrt{\epsilon}}$.
** Higher dimensions
- For a function $f:\mathbb{R}^2 \to \mathbb{R}$ we want to compute
  $$ \int_{a_1}^{b_1} \int_{a_2}^{b_2} f(x,y) \; dy \; dx$$
- We can write this as
  $$\int_{a_1}^{b_1} F(x)\;dx \quad\text{with}\quad F(x) = \int_{a_2}^{b_2} f(x,y)\;dy$$
- Define stepsizes $h_1 = \frac{b_1-a_1}{k_1}$ and $h_2 = \frac{b_2-a_2}{k_2}$
- To compute the $x$ integral we have to compute
  $$F(a_1), F(a_1 + h_1), ...$$
- Computing $F(x_i)$ is a one-dimensional integral (over $y$).
** Accuracy in higher dimensions
- When taking $k$ points in each direction, the error of a $d\text{-dimensional}$ integral is
  $$|R| = \mathcal{O}(h^2) = \mathcal{O}(\frac{1}{k^2})$$
  The total number of points needed is $n=k^d$.
- To achieve error $|R|\leq \epsilon$ we need
  $$n \propto \left(\frac{1}{\sqrt{\epsilon}}\right)^d$$
- *Curse of dimensionality*
** Monte Carlo
- Hit-or-miss
- Simple sampling

You will implement both methods
** Hit-or-miss
- Assume $f:[0,1]\to[0,1]$
  $$I(f) = \int_{0}^{1} f(x)\;dx$$
- Generate uniform random `shots'
  $$(x_1,y_1), (x_2,y_2), ...$$
  in $[0,1]\times[0,1]$.
- Count the number of shots that *hit* the area below the graph of $f$.
  $$N_f (n) = \#\{ i \leq n \mid y_i \leq f(x_i) \}$$
  Approximate the integral by $N_f(n) / n$.
** Hit-or-miss
- Define the random variable $B_f$ on the probability space $[0,1]\times[0,1]$
  $$B_f(x,y)=\begin{cases}1 & y \leq f(x)\\0 & y > f(x)\end{cases}$$
  $B_f$ is a Bernoulli variable
  $$\mathbb{E}(B_f) = \mathbb{P}(B_f) = I(f)$$
- By the law of large numbers
  $$\overline{B_n} \equiv \frac{1}{n} \sum_{i=1}^n b_i$$
  converges to $\mathbb{E}(B_f)$ as $n\to\infty$ where $b_i$ are realisations of $B_f$.
