lectures/week6/week6.tex
% Created 2019-03-11 Mon 13:19
% Intended LaTeX compiler: pdflatex
\documentclass[10pt]{beamer}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{minted}
\usepackage{tikz}
\definecolor{cwiRed}{HTML}{BF1238}
\definecolor{cwiBlue}{HTML}{0B5D7D}
\setbeamertemplate{footline}[text line]{%
\parbox{\linewidth}{\noindent\vspace*{2pt}\noindent\rule{\linewidth}{0.4pt}\\{\scriptsize\noindent\vspace*{7pt}\insertshortauthor\hfill\insertshorttitle\hfill\insertdate}}
}
\renewcommand*\footnoterule{}
\renewcommand{\vec}[1]{\mathbf{#1}}
\usepackage{lmodern}
\usetheme[progressbar=head]{metropolis}
\author{WISM454 Laboratory Class Scientific Computing, Jan-Willem Buurlage}
\date{\today}
\title{Monte Carlo methods}
\hypersetup{
 pdfauthor={WISM454 Laboratory Class Scientific Computing, Jan-Willem Buurlage},
 pdftitle={Monte Carlo methods},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.1 (Org mode 9.1.14)}, 
 pdflang={English}}
\begin{document}

\maketitle

\section{Organization}
\label{sec:org4cdad8f}
\begin{frame}[label={sec:org2e64313}]{Today}
\begin{itemize}
\item If you wish, you can e-mail me a zip file with your source files (do not
include anything other than *.hpp, *.cpp, CMakeLists.txt files).
\item I can give you initial feedback on your code and library design (not for a
grade). You can use this to improve your code before the report.
\item Only today!
\end{itemize}
\end{frame}
\begin{frame}[label={sec:org12f9393}]{Report I}
\begin{itemize}
\item \emph{Deadline:} April 17th
\item Content of report
\begin{enumerate}
\item \alert{Theory}.
\begin{itemize}
\item A description of LCRNGs and the influence of parameters.
\item Distributions, inversion and rejection.
\item A discussion on statistical properties and tests.
\item Numerical integration, Monte Carlo.
\end{itemize}
\item \alert{Software library}. Describe your software library, with discussions on usage
and design choices. After reading this section, the reader should be able to
understand how to use every aspect of your library.
\item \alert{Numerical results}.
\end{enumerate}
\end{itemize}
\end{frame}
\begin{frame}[label={sec:org71f1632}]{How it is graded}
\begin{itemize}
\item You will receive an independent grade for the following:
\begin{itemize}
\item Writing
\item Presentation
\item Experiments
\item Features
\item Code
\end{itemize}
\item They all count for 20\%.
\item Scientific writing skills are important for any researcher. I expect the
reports to be written with care. Try to avoid spending 99\% of your time on
your code and rushing the report.
\end{itemize}
\end{frame}
\begin{frame}[fragile,label={sec:org7b10331}]{Remarks on report}
 \begin{itemize}
\item Do not include your source code in the report, but instead \alert{e-mail} me a zip
file with your source files (do not include anything other than *.hpp, *.cpp,
CMakeLists.txt files).
\item Describe the overall structure of your code on a \alert{high-level}. For example,
discuss the different classes (such as \texttt{lcrng}) you have and how they relate
to each other.
\item All \alert{exercises} listed in the schedule, except those marked hand-in or optional,
are expected to be treated in your reports. Do not refer to them (or the
lecture notes in general) explicitly, but rather make them part of the story.
\item Provide \alert{benchmark results}, and the results of \alert{statistical tests} when run on
the RNG engines you provide. Be economical with your plots and tables. Make
sure that every result you include is indispensable for the story that you
want to tell about the RNGs and your library. After reading this, the reader
should be able to make an informed decision on which parts of your library they
want to use for his application.
\end{itemize}
\end{frame}
\section{Monte Carlo Methods (I)}
\label{sec:org5ef7311}
\begin{frame}[label={sec:orgaf34b94}]{Numerical computation of integrals}
\begin{itemize}
\item \alert{Input}: integration domain \(\Omega\subseteq \mathbb{R}^d\) and \alert{black box access} to $$f:\mathbb{R}^d\to\mathbb{R}$$
\item \alert{Output}: approximation of $$\int_\Omega f(\vec{x}) d\vec{x}$$
\end{itemize}
\end{frame}
\begin{frame}[label={sec:org8224d07}]{Three strategies}
Main idea:
$$\int_\Omega f(\vec{x}) d\vec{x} \approx \sum_{i \in I} w_i f(\vec{x}_i)$$

How to find \alert{weights} \(w_i\in\mathbb{R}\) and \alert{integration points} \(\vec{x}_i \in \mathbb{R}^d\)?

\begin{itemize}
\item Quadrature formulas \(\hfill\) ([LN] 3.1)
\item Monte Carlo \(\hfill\) ([LN] 3.2)
\item Low-discrepancy sampling \(\hfill\) ([LN] 3.3)
\end{itemize}
\end{frame}

\begin{frame}[label={sec:orga498faa}]{Quadrature formulas}
\begin{itemize}
\item Assume for now:
\begin{itemize}
\item 1-dimensional \(\quad f : \mathbb{R} \to \mathbb{R}\)
\item twice continuously differentiable
\end{itemize}
\item The \alert{trapezoidal rule} is
$$\int_{a}^{b} f(x) dx \approx \frac{b-a}{2}\left( f(a) + f(b) \right)$$
\item With \alert{remainder} (i.e. error)
$$R = - \frac{(b-a)^3}{12} f''(\eta)\qquad \text{for a }\eta\in[a,b]$$
\end{itemize}
\end{frame}

\begin{frame}[label={sec:org38732bb}]{Quadrature formulas}
\begin{itemize}
\item Divide \([a,b]\) into \(k\) intervals of size \(h = \frac{b-a}{k}\).

\item The \(k+1\) integration points are now \(\{a, a + h, a+2h, ..., b\}\)
$$\int_{a}^{b} f(x) dx \approx h \left( \frac{1}{2}f(a) + \left( \sum_{j=1}^{k-1} f(a+j\cdot h) \right) + \frac{1}{2}f(b) \right)$$
\item Remainder satisfies
$$R = \frac{b-a}{12} h^2 \left[ f'(b) - f'(a) \right] + \mathcal{O}(h^3) \quad \text{for } h\to 0$$
and is bounded by
$$|R| \leq \frac{b-a}{12} h^2 \; \max_{x\in[a,b]} | f''(x) |$$
\end{itemize}
\end{frame}
\begin{frame}[label={sec:orgaceceda}]{Accuracy}
\begin{itemize}
\item For \(k\) intervals of size \(h\)
$$|R| \leq \frac{b-a}{12} h^2 \; \max_{x\in[a,b]} | f''(x) |$$
\item For a fixed function \(f\) and fixed integration domain \([a,b]\) we have
$$|R| = \mathcal{O}(h^2) = \mathcal{O} \left( \frac{1}{k^2} \right)$$
\item To get accuracy \(|R| \leq \epsilon\), we require \(k \propto
  \frac{1}{\sqrt{\epsilon}}\).
\end{itemize}
\end{frame}
\begin{frame}[label={sec:orge260c6e}]{Higher dimensions}
\begin{itemize}
\item For a function \(f:\mathbb{R}^2 \to \mathbb{R}\) we want to compute
$$ \int_{a_1}^{b_1} \int_{a_2}^{b_2} f(x,y) \; dy \; dx$$
\item We can write this as
$$\int_{a_1}^{b_1} F(x)\;dx \quad\text{with}\quad F(x) = \int_{a_2}^{b_2} f(x,y)\;dy$$
\item Define stepsizes \(h_1 = \frac{b_1-a_1}{k_1}\) and \(h_2 = \frac{b_2-a_2}{k_2}\)
\item To compute the \(x\) integral we have to compute
$$F(a_1), F(a_1 + h_1), ...$$
\item Computing \(F(x_i)\) is a one-dimensional integral (over \(y\)).
\end{itemize}
\end{frame}
\begin{frame}[label={sec:orgcc4c84f}]{Accuracy in higher dimensions}
\begin{itemize}
\item When taking \(k\) points in each direction, the error of a \(d\text{-dimensional}\) integral is
$$|R| = \mathcal{O}(h^2) = \mathcal{O}(\frac{1}{k^2})$$
The total number of points needed is \(n=k^d\).
\item To achieve error \(|R|\leq \epsilon\) we need
$$n \propto \left(\frac{1}{\sqrt{\epsilon}}\right)^d$$
\item \alert{Curse of dimensionality}
\end{itemize}
\end{frame}
\begin{frame}[label={sec:org325ebac}]{Monte Carlo}
\begin{itemize}
\item Hit-or-miss
\item Simple sampling
\end{itemize}

You will implement both methods
\end{frame}
\begin{frame}[label={sec:orgdafce8c}]{Hit-or-miss}
\begin{itemize}
\item Assume \(f:[0,1]\to[0,1]\)
$$I(f) = \int_{0}^{1} f(x)\;dx$$
\item Generate uniform random `shots'
$$(x_1,y_1), (x_2,y_2), ...$$
in \([0,1]\times[0,1]\).
\item Count the number of shots that \alert{hit} the area below the graph of \(f\).
$$N_f (n) = \#\{ i \leq n \mid y_i \leq f(x_i) \}$$
Approximate the integral by \(N_f(n) / n\).
\end{itemize}
\end{frame}
\begin{frame}[label={sec:orgaf488ab}]{Hit-or-miss}
\begin{itemize}
\item Define the random variable \(B_f\) on the probability space \([0,1]\times[0,1]\)
$$B_f(x,y)=\begin{cases}1 & y \leq f(x)\\0 & y > f(x)\end{cases}$$
\(B_f\) is a Bernoulli variable
$$\mathbb{E}(B_f) = \mathbb{P}(B_f) = I(f)$$
\item By the law of large numbers
$$\overline{B_n} \equiv \frac{1}{n} \sum_{i=1}^n b_i$$
converges to \(\mathbb{E}(B_f)\) as \(n\to\infty\) where \(b_i\) are realisations of \(B_f\).
\end{itemize}
\end{frame}
