lectures/week6/week6.org
** Hit-or-miss accuracy
$$\mathbb{E}(B_f) = I(f)$$
$$\overline{B_n} \equiv \frac{1}{n} \sum_{i=1}^n b_i = \frac{N_f(n)}{n}$$
- The expected error:
  $$\mathbb{E}(\;|\overline{B_n} - \mathbb{E}(B_f)|\;) \leq \frac{1}{\sqrt{n}} \sqrt{\mathrm{Var}(B_f)}$$
- Bernoulli variables: $\mathrm{Var}(B_f) = \mathbb{P}(B_f) (1-\mathbb{P}(B_f))$
  $$\mathbb{E}\left( \left\vert \frac{N_f(n)}{n} - I(f) \right\vert \right) \leq \sqrt{\frac{I(f)(1-I(f))}{n}} \leq \frac{1}{2\sqrt{n}}$$
** Multi-dimensional hit-or-miss
- Assume $f:[0,1]^d \to [0,1]$
- Generate uniform random *shots* of the form $(x_1,...,x_d,y)$.
- Count the number of shots for which $y < f(x_1,...,x_d)$.
- What is the expected error?
** Simple sampling

$$\int_{a}^{b} f(x)\; dx$$

- Let $Q$ be a random variable that is *uniform* over $[a,b]$.

- The density function $q$ of $Q$ is constant: $q(x) = \frac{1}{b-a}$ for $x\in[a,b]$.

- Consider the random variable $f(Q)$ then
  $$\int_a^b f(x) \; dx = (b-a) \;\; \mathbb{E}\left( f(Q) \right)$$

** Simple sampling accuracy
- By the law of large numbers
  $$\overline{f(Q)_n} = \frac{1}{n} \sum_{i=1}^n f(q_i) \; \to \; \mathbb{E}(f(Q))$$
  where $q_i$ are realisations of $Q$.
- Expected error
  $$\mathbb{E}\left( \left\vert \overline{f(Q)_n} - \mathbb{E}(f(Q)) \right\vert \right) \leq \frac{1}{\sqrt{n}} \sqrt{\mathrm{Var}(f(Q))}$$
- Estimate for $\mathrm{Var}(f(Q))$:
  $$\frac{1}{n-1}\sum_{i=1}^n \left[ f(q_i) - \overline{f(Q)_n} \right]^2$$
** Multi-dimensional simple sampling

- Let $Q$ be uniform over $\mathbf{J} = [a_1,b_1]\times...\times[a_d,b_d]$
  $$\int_{\mathbf{J}} f(\vec{x}) \; d\vec{x} = (b_1-a_1)\cdots(b_d-a_d)\;\mathbb{E}(f(Q))$$
- The error is bounded by
  $$\frac{1}{\sqrt{n}}\sqrt{\mathrm{Var}(f(Q))}$$

** Multi-dimensional simple sampling

What if the integration domain $\Omega$ is not a rectangle?
$$\int_\Omega f(\vec{x})\;d\vec{x} = \int_{a_1}^{b_1} \int_{a_2(x_1)}^{b_2(x_1)} \cdots \int_{a_d(x_1,...,x_{d-1})}^{b_d(x_1,...,x_{d-1})} f(\vec{x}) \;dx_d \cdots dx_1$$
Use repeated 1-dimensional simple sampling, then
$$\int_\Omega f(\vec{x})\;d\vec{x} \approx \frac{1}{|\mathcal{I}|} \sum_{\vec{x}\in\mathcal{I}} w(\vec{x}) f(\vec{x})$$

** Conclusions

- Quadrature methods
    - Trapezoidal rule
    - Error depends on $\frac{1}{k^2}\;\max_x |f''(x)|$
    - $n = k^d$ points in $d$ dimensions
    - To achieve error $\epsilon$ we need
$$n \propto \left(\frac{1}{\epsilon}\right)^{d/2}$$
- Monte Carlo methods
    - Hit-or-miss
    - Simple sampling
    - To achieve error $\epsilon$ we need
$$n \propto \left(\frac{1}{\epsilon}\right)^{2}$$
* C++
** Functions as objects

- In C++ we can store functions using =std::function=.

#+BEGIN_SRC cpp
// Example
int myfunction(float x, int y) {
    return ...;
}

std::function<int(float,int)> f = myfunction;

int z1 = myfunction(3.14, 15);
int z2 = f(3.14, 15);

// General syntax
std::function<result_type()> g;
std::function<result_type(argument_type,...)> h;
#+END_SRC

** Functions as objects


Why?

- Pass a function as an argument to another function
    - =integrate( f, ... )=
- Store a function
    - Common examples are _callbacks_ or _event handlers_.

#+BEGIN_SRC cpp
void create_button(int x, int y,
                   std::function<void()> onclick);

void myfunction() {
    std::cout << "Button clicked!" << std::endl;
}

create_button(100, 200, myfunction);
#+END_SRC

** Functions as objects

- You have seen other examples:
    - =std::accumulate=
    - =std::transform=
    - =std::generate=
    - =std::any_of=
    - ...

#+BEGIN_SRC cpp
int square(int x) {
    return x * x;
}

// xs <- [1,2,3,4,5]
std::transform(xs.begin(), xs.end(), xs.begin(),
               square);
// xs <- [1,4,9,16,25]
#+END_SRC

** Functions as objects

- Good for Monte Carlo integration

#+BEGIN_SRC cpp
class mcintegrator {
    ...
    float integrate(std::function<float(float)> f,
                    float a, float b, int n) {
        return ...;
    }
    ...
    // f : T -> T
    template <typename T>
    T integrate(std::function<T(T)> f,
                T a, T b, int n) {
        return ...;
    }
};
#+END_SRC

** Functions as objects

- Function object can be _empty_

#+BEGIN_SRC cpp
int myfunction() { return 3; }

std::function<int()> f;
std::function<int()> g = myfunction;

if (f)
    f(); // not called

if (g)
    g(); // called

g = nullptr;

if (g)
    g(); // not called
#+END_SRC

** Functions as objects
- =std::function= can store any *callable* object
#+BEGIN_SRC cpp
  class myclass {
    public:
      int operator()(int x) {
          return z + x;
      }
      int z;
  };

  myclass a;
  a.z = 5;
  int y = a(3); // y <- 8

  std::function<int(int)> f = a;
  int z = f(4);
#+END_SRC

** Anonymous functions



- Anonymous functions, also known as *lambda* functions

#+BEGIN_SRC cpp
int square(int x) {
    return x * x;
}
// xs <- [1,2,3,4,5]
std::transform(xs.begin(), xs.end(), xs.begin(),
               square);
// xs <- [1,4,9,16,25]
std::transform(xs.begin(), xs.end(), xs.begin(),
               [](int x) { return x+1; } );
// xs <- [2,5,10,17,26]
std::function<int(int)> f = square;
std::function<int(int)> g = [](int x) { return x+1; };
#+END_SRC

** Lambda function syntax

#+BEGIN_SRC cpp
// simple version
[] (parameters) { body }

// (almost) full version
[captures] (parameters) -> return_type { body }
#+END_SRC

** Capturing variables



#+BEGIN_SRC cpp
std::vector<int> xs = {1,2,3,4,5};
int a = 3;

// Does *not* compile!
std::transform(xs.begin(), xs.end(), xs.begin(),
               [](int x) { return x+a; } );

// This works
std::transform(xs.begin(), xs.end(), xs.begin(),
               [a](int x) { return x+a; } );
#+END_SRC
- The variable =a= is *captured* by the lambda function

** Capturing variables

#+BEGIN_SRC cpp
std::vector<int> xs(100, 0);
int a = 5, b = 0, c = 0;

// xs <- {0, 0, ..., 0}
std::generate(xs.begin(), xs.end(),
            [a, &b]() {
                b++;
                return a + b;
            } );
// xs <- {6, 7, ..., 105}
// a  <- 5
// b  <- 100
// c  <- 0
#+END_SRC
- The variable =a= is captured by **value**
- The variable =b= is captured by **reference**
- The variable =c= is not captured

** Capturing variables

#+BEGIN_SRC cpp
std::vector<int> xs(100, 0);
int a = 5, b = 0, c = 0;

// xs <- {0, 0, ..., 0}
std::generate(xs.begin(), xs.end(),
            [&]() {
                b++;
                return a + b;
            } );
// xs <- {6, 7, ..., 105}
// a  <- 5
// b  <- 100
// c  <- 0
#+END_SRC
- The variable =a= is captured by **reference**
- The variable =b= is captured by **reference**
- The variable =c= is not captured

