lectures/week6/week6.tex
\begin{frame}[label={sec:org86ca8ab}]{Hit-or-miss accuracy}
$$\mathbb{E}(B_f) = I(f)$$
$$\overline{B_n} \equiv \frac{1}{n} \sum_{i=1}^n b_i = \frac{N_f(n)}{n}$$
\begin{itemize}
\item The expected error:
$$\mathbb{E}(\;|\overline{B_n} - \mathbb{E}(B_f)|\;) \leq \frac{1}{\sqrt{n}} \sqrt{\mathrm{Var}(B_f)}$$
\item Bernoulli variables: \(\mathrm{Var}(B_f) = \mathbb{P}(B_f) (1-\mathbb{P}(B_f))\)
$$\mathbb{E}\left( \left\vert \frac{N_f(n)}{n} - I(f) \right\vert \right) \leq \sqrt{\frac{I(f)(1-I(f))}{n}} \leq \frac{1}{2\sqrt{n}}$$
\end{itemize}
\end{frame}
\begin{frame}[label={sec:org2e372ab}]{Multi-dimensional hit-or-miss}
\begin{itemize}
\item Assume \(f:[0,1]^d \to [0,1]\)
\item Generate uniform random \alert{shots} of the form \((x_1,...,x_d,y)\).
\item Count the number of shots for which \(y < f(x_1,...,x_d)\).
\item What is the expected error?
\end{itemize}
\end{frame}
\begin{frame}[label={sec:orgadbe8cb}]{Simple sampling}
$$\int_{a}^{b} f(x)\; dx$$

\begin{itemize}
\item Let \(Q\) be a random variable that is \alert{uniform} over \([a,b]\).

\item The density function \(q\) of \(Q\) is constant: \(q(x) = \frac{1}{b-a}\) for \(x\in[a,b]\).

\item Consider the random variable \(f(Q)\) then
$$\int_a^b f(x) \; dx = (b-a) \;\; \mathbb{E}\left( f(Q) \right)$$
\end{itemize}
\end{frame}

\begin{frame}[label={sec:org17dc90d}]{Simple sampling accuracy}
\begin{itemize}
\item By the law of large numbers
$$\overline{f(Q)_n} = \frac{1}{n} \sum_{i=1}^n f(q_i) \; \to \; \mathbb{E}(f(Q))$$
where \(q_i\) are realisations of \(Q\).
\item Expected error
$$\mathbb{E}\left( \left\vert \overline{f(Q)_n} - \mathbb{E}(f(Q)) \right\vert \right) \leq \frac{1}{\sqrt{n}} \sqrt{\mathrm{Var}(f(Q))}$$
\item Estimate for \(\mathrm{Var}(f(Q))\):
$$\frac{1}{n-1}\sum_{i=1}^n \left[ f(q_i) - \overline{f(Q)_n} \right]^2$$
\end{itemize}
\end{frame}
\begin{frame}[label={sec:org33f5491}]{Multi-dimensional simple sampling}
\begin{itemize}
\item Let \(Q\) be uniform over \(\mathbf{J} = [a_1,b_1]\times...\times[a_d,b_d]\)
$$\int_{\mathbf{J}} f(\vec{x}) \; d\vec{x} = (b_1-a_1)\cdots(b_d-a_d)\;\mathbb{E}(f(Q))$$
\item The error is bounded by
$$\frac{1}{\sqrt{n}}\sqrt{\mathrm{Var}(f(Q))}$$
\end{itemize}
\end{frame}

\begin{frame}[label={sec:orge728309}]{Multi-dimensional simple sampling}
What if the integration domain \(\Omega\) is not a rectangle?
$$\int_\Omega f(\vec{x})\;d\vec{x} = \int_{a_1}^{b_1} \int_{a_2(x_1)}^{b_2(x_1)} \cdots \int_{a_d(x_1,...,x_{d-1})}^{b_d(x_1,...,x_{d-1})} f(\vec{x}) \;dx_d \cdots dx_1$$
Use repeated 1-dimensional simple sampling, then
$$\int_\Omega f(\vec{x})\;d\vec{x} \approx \frac{1}{|\mathcal{I}|} \sum_{\vec{x}\in\mathcal{I}} w(\vec{x}) f(\vec{x})$$
\end{frame}

\begin{frame}[label={sec:org65ad1e8}]{Conclusions}
\begin{itemize}
\item Quadrature methods
\begin{itemize}
\item Trapezoidal rule
\item Error depends on \(\frac{1}{k^2}\;\max_x |f''(x)|\)
\item \(n = k^d\) points in \(d\) dimensions
\item To achieve error \(\epsilon\) we need
\end{itemize}
\end{itemize}
$$n \propto \left(\frac{1}{\epsilon}\right)^{d/2}$$
\begin{itemize}
\item Monte Carlo methods
\begin{itemize}
\item Hit-or-miss
\item Simple sampling
\item To achieve error \(\epsilon\) we need
\end{itemize}
\end{itemize}
$$n \propto \left(\frac{1}{\epsilon}\right)^{2}$$
\end{frame}
\section{C++}
\label{sec:org91eabf0}
\begin{frame}[fragile,label={sec:org3869e9d}]{Functions as objects}
 \begin{itemize}
\item In C++ we can store functions using \texttt{std::function}.
\end{itemize}

\begin{minted}[frame=none,xleftmargin=\parindent]{cpp}
// Example
int myfunction(float x, int y) {
    return ...;
}

std::function<int(float,int)> f = myfunction;

int z1 = myfunction(3.14, 15);
int z2 = f(3.14, 15);

// General syntax
std::function<result_type()> g;
std::function<result_type(argument_type,...)> h;
\end{minted}
\end{frame}

\begin{frame}[fragile,label={sec:org99a224c}]{Functions as objects}
 Why?

\begin{itemize}
\item Pass a function as an argument to another function
\begin{itemize}
\item \texttt{integrate( f, ... )}
\end{itemize}
\item Store a function
\begin{itemize}
\item Common examples are \uline{callbacks} or \uline{event handlers}.
\end{itemize}
\end{itemize}

\begin{minted}[frame=none,xleftmargin=\parindent]{cpp}
void create_button(int x, int y,
                   std::function<void()> onclick);

void myfunction() {
    std::cout << "Button clicked!" << std::endl;
}

create_button(100, 200, myfunction);
\end{minted}
\end{frame}

\begin{frame}[fragile,label={sec:orgaa2fc43}]{Functions as objects}
 \begin{itemize}
\item You have seen other examples:
\begin{itemize}
\item \texttt{std::accumulate}
\item \texttt{std::transform}
\item \texttt{std::generate}
\item \texttt{std::any\_of}
\item \ldots{}
\end{itemize}
\end{itemize}

\begin{minted}[frame=none,xleftmargin=\parindent]{cpp}
int square(int x) {
    return x * x;
}

// xs <- [1,2,3,4,5]
std::transform(xs.begin(), xs.end(), xs.begin(),
               square);
// xs <- [1,4,9,16,25]
\end{minted}
\end{frame}

\begin{frame}[fragile,label={sec:orgdacb95a}]{Functions as objects}
 \begin{itemize}
\item Good for Monte Carlo integration
\end{itemize}

\begin{minted}[frame=none,xleftmargin=\parindent]{cpp}
class mcintegrator {
    ...
    float integrate(std::function<float(float)> f,
                    float a, float b, int n) {
        return ...;
    }
    ...
    // f : T -> T
    template <typename T>
    T integrate(std::function<T(T)> f,
                T a, T b, int n) {
        return ...;
    }
};
\end{minted}
\end{frame}

\begin{frame}[fragile,label={sec:orgcf9fad0}]{Functions as objects}
 \begin{itemize}
\item Function object can be \uline{empty}
\end{itemize}

\begin{minted}[frame=none,xleftmargin=\parindent]{cpp}
int myfunction() { return 3; }

std::function<int()> f;
std::function<int()> g = myfunction;

if (f)
    f(); // not called

if (g)
    g(); // called

g = nullptr;

if (g)
    g(); // not called
\end{minted}
\end{frame}

\begin{frame}[fragile,label={sec:org9cfc313}]{Functions as objects}
 \begin{itemize}
\item \texttt{std::function} can store any \alert{callable} object
\end{itemize}
\begin{minted}[frame=none,xleftmargin=\parindent]{cpp}
class myclass {
  public:
    int operator()(int x) {
        return z + x;
    }
    int z;
};

myclass a;
a.z = 5;
int y = a(3); // y <- 8

std::function<int(int)> f = a;
int z = f(4);
\end{minted}
\end{frame}

\begin{frame}[fragile,label={sec:org864d0b2}]{Anonymous functions}
 \begin{itemize}
\item Anonymous functions, also known as \alert{lambda} functions
\end{itemize}

\begin{minted}[frame=none,xleftmargin=\parindent]{cpp}
int square(int x) {
    return x * x;
}
// xs <- [1,2,3,4,5]
std::transform(xs.begin(), xs.end(), xs.begin(),
               square);
// xs <- [1,4,9,16,25]
std::transform(xs.begin(), xs.end(), xs.begin(),
               [](int x) { return x+1; } );
// xs <- [2,5,10,17,26]
std::function<int(int)> f = square;
std::function<int(int)> g = [](int x) { return x+1; };
\end{minted}
\end{frame}

\begin{frame}[fragile,label={sec:org14c0c1d}]{Lambda function syntax}
 \begin{minted}[frame=none,xleftmargin=\parindent]{cpp}
// simple version
[] (parameters) { body }

// (almost) full version
[captures] (parameters) -> return_type { body }
\end{minted}
\end{frame}

\begin{frame}[fragile,label={sec:orgc410187}]{Capturing variables}
 \begin{minted}[frame=none,xleftmargin=\parindent]{cpp}
std::vector<int> xs = {1,2,3,4,5};
int a = 3;

// Does *not* compile!
std::transform(xs.begin(), xs.end(), xs.begin(),
               [](int x) { return x+a; } );

// This works
std::transform(xs.begin(), xs.end(), xs.begin(),
               [a](int x) { return x+a; } );
\end{minted}
\begin{itemize}
\item The variable \texttt{a} is \alert{captured} by the lambda function
\end{itemize}
\end{frame}

\begin{frame}[fragile,label={sec:orgddf8b02}]{Capturing variables}
 \begin{minted}[frame=none,xleftmargin=\parindent]{cpp}
std::vector<int> xs(100, 0);
int a = 5, b = 0, c = 0;

// xs <- {0, 0, ..., 0}
std::generate(xs.begin(), xs.end(),
            [a, &b]() {
                b++;
                return a + b;
            } );
// xs <- {6, 7, ..., 105}
// a  <- 5
// b  <- 100
// c  <- 0
\end{minted}
\begin{itemize}
\item The variable \texttt{a} is captured by \alert{\alert{value}}
\item The variable \texttt{b} is captured by \alert{\alert{reference}}
\item The variable \texttt{c} is not captured
\end{itemize}
\end{frame}
