lectures/week6/week6.org
** Capturing variables

- =[a]= capture =a= by **value**
- =[&a]= capture =a= by **reference**
- =[&]= captures **all** variables used in the lambda by **reference**
- =[=]= captures **all** variables used in the lambda by **value**
- =[&, a]= captures variables like with =[&]=, but =a= by value
- ~[=, &a]~ captures variables like with =[=]=, but =a= by reference

** Capturing variables

#+BEGIN_SRC cpp
int a = 5, b = 2, c = 0;
std::function<int()> f = [&, a]() { b++; return a + b; };
// a <- 5 , b <- 2 , c <- 0
c = f();
#+END_SRC
\pause
#+BEGIN_SRC cpp
// a <- 5  , b <- 3 , c <- 8
c = f();
a = 20;
#+END_SRC
\pause
#+BEGIN_SRC cpp
// a <- 20 , b <- 4 , c <- 9
c = f();
b = 100;
#+END_SRC
\pause
#+BEGIN_SRC cpp
// a <- 20 , b <- 100 , c <- 10
c = f();
#+END_SRC
\pause
#+BEGIN_SRC cpp
// a <- 20 , b <- 101 , c <- 106
#+END_SRC

** Comparison with `old C++'

#+BEGIN_SRC cpp
int myfunction(float x, int y) { return 3; }

int (*oldf)(float,int)             = myfunction; // Old
std::function<int(float,int)> newf = myfunction; // New

int a = *oldf(3.1, 4);
int b =  newf(3.1, 4);

// Old
int func1( int (*f)(float,int) ) {...}
// New
int func2( std::function<int(float,int)> f ) {...}
#+END_SRC
- Old function pointers can **not** store arbitrary *callable* objects
- They can store lambda functions but only **without** captures

** Values and references
- =std::function= object can store data so passing by reference makes sense
- When used with lambdas, passing by value makes sense because of *move semantics*
** Smart pointers
- Regular pointers
- Unique pointers
- Shared pointers
** Regular pointers

- Pointers can be used for objects on the heap

#+BEGIN_SRC cpp
int* x = new int;

*x = 5;

delete x;
#+END_SRC

** Regular pointers

- Pointers are ``dangerous''

#+BEGIN_SRC cpp
int myfunction (...) {
    int* x = new int;
    *x = 3;
    ...
    ...
    ...
    ...
    ...
    ...
    ...
    ...
    delete x;
    return result;
}
#+END_SRC

** Regular pointers

- Pointers are ``dangerous''

#+BEGIN_SRC cpp
int myfunction (...) {
    int* x = new int;
    *x = 3;
    ...
    ...
    if (error) {
        return 0;
    }
    ...
    ...
    ...
    delete x;
    return result;
}
#+END_SRC

** Unique pointers

- =std::unique_ptr= is a *smart pointer*
- Takes care of deleting the object at the right time

#+BEGIN_SRC cpp
int myfunction (...) {
    std::unique_ptr<int> x = std::make_unique<int>();
    *x = 3;
    ...
    ...
    if (error) {
        return 0;
    }
    ...
    ...
    return result;
}
#+END_SRC

** Unique pointers

- =std::unique_ptr= takes care of *ownership*

#+BEGIN_SRC cpp
int myfunction (std::unique_ptr<int> x) {
    ...
}

std::unique_ptr<int> a = std::make_unique<int>();
*a = 3;
// Now we pass the ownership to myfunction
myfunction(std::move(a));

// Here a is no longer valid
if (a)
    std::cout << "a is valid" << std::endl;
else
    std::cout << "a is not valid" << std::endl;
#+END_SRC

** Shared pointers

- You can not pass =std::unique_ptr= to different functions
- For this we have =std::shared_ptr=

#+BEGIN_SRC cpp
class rng;   // base class in your library
class lcrng; // subclass in your library

// Create random number generator
std::shared_ptr<rng> park_miller =
        std::make_shared<lcrng>(16807, ...);

int x = park_miller->next(); // Use the shared pointer

// Pass the shared pointer to other functions
output_random_numbers(park_miller);
// Use it to create your Monte Carlo class
mcintegrator mc(park_miller);
mc.integrate(myfunction);
#+END_SRC

** Conclusion
- =std::function=
  - store functions
  - functions as arguments
- Lambda functions
  - easy way of passing small functions to other functions
  - captures
- Smart pointers
  - safe way of dealing with pointers
