lectures/week6/week6.tex

\begin{frame}[fragile,label={sec:org2a42341}]{Capturing variables}
 \begin{minted}[frame=none,xleftmargin=\parindent]{cpp}
std::vector<int> xs(100, 0);
int a = 5, b = 0, c = 0;

// xs <- {0, 0, ..., 0}
std::generate(xs.begin(), xs.end(),
            [&]() {
                b++;
                return a + b;
            } );
// xs <- {6, 7, ..., 105}
// a  <- 5
// b  <- 100
// c  <- 0
\end{minted}
\begin{itemize}
\item The variable \texttt{a} is captured by \alert{\alert{reference}}
\item The variable \texttt{b} is captured by \alert{\alert{reference}}
\item The variable \texttt{c} is not captured
\end{itemize}
\end{frame}

\begin{frame}[fragile,label={sec:org7c7c815}]{Capturing variables}
 \begin{itemize}
\item \texttt{[a]} capture \texttt{a} by \alert{\alert{value}}
\item \texttt{[\&a]} capture \texttt{a} by \alert{\alert{reference}}
\item \texttt{[\&]} captures \alert{\alert{all}} variables used in the lambda by \alert{\alert{reference}}
\item \texttt{[=]} captures \alert{\alert{all}} variables used in the lambda by \alert{\alert{value}}
\item \texttt{[\&, a]} captures variables like with \texttt{[\&]}, but \texttt{a} by value
\item \texttt{[=, \&a]} captures variables like with \texttt{[=]}, but \texttt{a} by reference
\end{itemize}
\end{frame}

\begin{frame}[fragile,label={sec:org2483391}]{Capturing variables}
 \begin{minted}[frame=none,xleftmargin=\parindent]{cpp}
int a = 5, b = 2, c = 0;
std::function<int()> f = [&, a]() { b++; return a + b; };
// a <- 5 , b <- 2 , c <- 0
c = f();
\end{minted}
\pause
\begin{minted}[frame=none,xleftmargin=\parindent]{cpp}
// a <- 5  , b <- 3 , c <- 8
c = f();
a = 20;
\end{minted}
\pause
\begin{minted}[frame=none,xleftmargin=\parindent]{cpp}
// a <- 20 , b <- 4 , c <- 9
c = f();
b = 100;
\end{minted}
\pause
\begin{minted}[frame=none,xleftmargin=\parindent]{cpp}
// a <- 20 , b <- 100 , c <- 10
c = f();
\end{minted}
\pause
\begin{minted}[frame=none,xleftmargin=\parindent]{cpp}
// a <- 20 , b <- 101 , c <- 106
\end{minted}
\end{frame}

\begin{frame}[fragile,label={sec:org8d5c8ec}]{Comparison with `old C++'}
 \begin{minted}[frame=none,xleftmargin=\parindent]{cpp}
int myfunction(float x, int y) { return 3; }

int (*oldf)(float,int)             = myfunction; // Old
std::function<int(float,int)> newf = myfunction; // New

int a = *oldf(3.1, 4);
int b =  newf(3.1, 4);

// Old
int func1( int (*f)(float,int) ) {...}
// New
int func2( std::function<int(float,int)> f ) {...}
\end{minted}
\begin{itemize}
\item Old function pointers can \alert{\alert{not}} store arbitrary \alert{callable} objects
\item They can store lambda functions but only \alert{\alert{without}} captures
\end{itemize}
\end{frame}

\begin{frame}[fragile,label={sec:org9662e44}]{Values and references}
 \begin{itemize}
\item \texttt{std::function} object can store data so passing by reference makes sense
\item When used with lambdas, passing by value makes sense because of \alert{move semantics}
\end{itemize}
\end{frame}
\begin{frame}[label={sec:org8943327}]{Smart pointers}
\begin{itemize}
\item Regular pointers
\item Unique pointers
\item Shared pointers
\end{itemize}
\end{frame}
\begin{frame}[fragile,label={sec:orgf4e0116}]{Regular pointers}
 \begin{itemize}
\item Pointers can be used for objects on the heap
\end{itemize}

\begin{minted}[frame=none,xleftmargin=\parindent]{cpp}
int* x = new int;

*x = 5;

delete x;
\end{minted}
\end{frame}

\begin{frame}[fragile,label={sec:org83dccf5}]{Regular pointers}
 \begin{itemize}
\item Pointers are ``dangerous''
\end{itemize}

\begin{minted}[frame=none,xleftmargin=\parindent]{cpp}
int myfunction (...) {
    int* x = new int;
    *x = 3;
    ...
    ...
    ...
    ...
    ...
    ...
    ...
    ...
    delete x;
    return result;
}
\end{minted}
\end{frame}

\begin{frame}[fragile,label={sec:org682a477}]{Regular pointers}
 \begin{itemize}
\item Pointers are ``dangerous''
\end{itemize}

\begin{minted}[frame=none,xleftmargin=\parindent]{cpp}
int myfunction (...) {
    int* x = new int;
    *x = 3;
    ...
    ...
    if (error) {
        return 0;
    }
    ...
    ...
    ...
    delete x;
    return result;
}
\end{minted}
\end{frame}

\begin{frame}[fragile,label={sec:orge99600f}]{Unique pointers}
 \begin{itemize}
\item \texttt{std::unique\_ptr} is a \alert{smart pointer}
\item Takes care of deleting the object at the right time
\end{itemize}

\begin{minted}[frame=none,xleftmargin=\parindent]{cpp}
int myfunction (...) {
    std::unique_ptr<int> x = std::make_unique<int>();
    *x = 3;
    ...
    ...
    if (error) {
        return 0;
    }
    ...
    ...
    return result;
}
\end{minted}
\end{frame}

\begin{frame}[fragile,label={sec:org706cc18}]{Unique pointers}
 \begin{itemize}
\item \texttt{std::unique\_ptr} takes care of \alert{ownership}
\end{itemize}

\begin{minted}[frame=none,xleftmargin=\parindent]{cpp}
int myfunction (std::unique_ptr<int> x) {
    ...
}

std::unique_ptr<int> a = std::make_unique<int>();
*a = 3;
// Now we pass the ownership to myfunction
myfunction(std::move(a));

// Here a is no longer valid
if (a)
    std::cout << "a is valid" << std::endl;
else
    std::cout << "a is not valid" << std::endl;
\end{minted}
\end{frame}

\begin{frame}[fragile,label={sec:org66eb9b9}]{Shared pointers}
 \begin{itemize}
\item You can not pass \texttt{std::unique\_ptr} to different functions
\item For this we have \texttt{std::shared\_ptr}
\end{itemize}

\begin{minted}[frame=none,xleftmargin=\parindent]{cpp}
class rng;   // base class in your library
class lcrng; // subclass in your library

// Create random number generator
std::shared_ptr<rng> park_miller =
        std::make_shared<lcrng>(16807, ...);

int x = park_miller->next(); // Use the shared pointer

// Pass the shared pointer to other functions
output_random_numbers(park_miller);
// Use it to create your Monte Carlo class
mcintegrator mc(park_miller);
mc.integrate(myfunction);
\end{minted}
\end{frame}

\begin{frame}[fragile,label={sec:orgd729b3e}]{Conclusion}
 \begin{itemize}
\item \texttt{std::function}
\begin{itemize}
\item store functions
\item functions as arguments
\end{itemize}
\item Lambda functions
\begin{itemize}
\item easy way of passing small functions to other functions
\item captures
\end{itemize}
\item Smart pointers
\begin{itemize}
\item safe way of dealing with pointers
\end{itemize}
\end{itemize}
\end{frame}
\end{document}